"""
============================
Author:柠檬班-木森
Time:2019/12/25
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
运算符


1、算术运算符：加+   减-   乘*   除/   取余%   幂运算**  //:向下取整（取商）

2、赋值运算符：=  +=  -=   *=  /=  %=

3、比较运算符： == !=  <  >  >=   <=  

4、逻辑运算符： 
and :  一假为假
or  :  一真为真
not ：取反


"""

# ----------------------算术运算---------------------------
# a = 10
# b = 100
# print(a%b)
# 幂运算
# print(2**4)

# 取商
# print(15//7)
# 取余
# print(15%7)

# -----------------------赋值运算------------------------

# aa = 1
# print(aa)

# +=   --->  对原来的数据进行相加

# a = 1
# a += 1  # ---> a = a +1
# print(a)

# a -= b   --->  a = a-b

# -------比较运算符--------------------
# a = 11
# b = 10

# 比较a和b是否相等  相等的话返回一个值为True，不相等就是False
# print(a == b)

# 比较a和b是否不相等  不相等的话返回一个值为True，相等就是False
# print(a != b)


# ----------逻辑运算符----------------
a = 10
b = 20
c = 30
d = 5

# 请问a<b  和 c>d这两个条件是否都成立
# and：所有的条件都成立，返回True,否则就是False
# print(a < b and c > d)

# or:只要有一个（以上）条件成立，就返回True,否则就是False
# print(8 > 7 or 10 < 15)

# not:取反
# print(not 8>4)


# 运算符优先级的  ： 1+4*5/8

# (not  a < b) and c > d

# 一个括号搞定
