"""
============================
Author:柠檬班-木森
Time:2019/12/25
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
下标取值：
    从前往后下标是从0开始的
    从后往前下标是从-1开始的


切片：
[start_index:end_index]:左闭右开（取头不取尾）




"""

s1 = "python java php c++"

# 下标取值
# print(s1[-5])


# 切片:左闭右开（取头不取尾）
# print(s1[7:11])

# print(s1[12:-4])
# print(s1[-7:-4])
# print(s1[:])


# 切片加步长()
# s2 = "123456789"
# 123456789
# print(s2[1:8:2])


# 反向 切片
# s2 = "123456789"
# print(s2[::])

# 获取  765
# print(s2[6:3:-1])

#  正向切片（步长为正）  起始位置值  小于  结束位置的值
#  反向切片（步长为负）  起始位置值  大于 结束位置的值




#  pycharm代码格式化快捷键：ctrl + Alt + L


s3 = "0123456789"
# print(s3[5:2:-1])

# s4 = s3[::-1]
# print(s4[4:7])

# s7= s3[3:6]
# print(s7[::-1])
