"""
============================
Author:柠檬班-木森
Time:2019/12/27
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
1、find方法：查找指定元素的下标位置
2、count:查找指定元素的个数
3、replace：替换的方法
4、split:分割的方法    
5、upper:把小写的字母变成大写
6、lower：把大写的字母变成小写


"""

# s = "python1234java5678php"
# 查找指定元素的下标位置,没有找到返回的是-1
# res = s.find('java')
# print(res)

# 查找指定元素的个数
# res2 = s.count("php")
# print(res2)

# 替换
# 第一个参数：待替换的字符串片段
# 第二个参数：替换之后的字符串片段
# 第三个参数：默认是替换所有的，也可以通过第三个参数来控制替换的次数
# res3 = s.replace("p", "aa", 2)
# print(res3)


# 字符串分割
# 第一个参数：分割点
# 第二个参数：默认是找到所有的分割点进行分割，也可以通过第二个参数来控制分割的次数
# s2 = "a123a456a789"
# s2 = "123aa456aa789aa888aa999"
# res4 = s2.split('a',2)
# print(res4)


# 把小写的字母变成大写
# s3 = "abc1234"
# res5 = s3.upper()
# print(res5)

# 把大写的字母变成小写
# s4 = "ABCHKK890"
# res6 = s4.lower()
# print(res6)





