"""
============================
Author:柠檬班-木森
Time:2019/12/27
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

# print("今天收到张三，交来学费500，开此收据为凭证")
# # print("今天收到李四，交来学费500，开此收据为凭证")
# # print("今天收到王五，交来学费500，开此收据为凭证")
# # print("今天收到小虾米，交来学费500，开此收据为凭证")
# # print("今天收到大螃蟹，交来学费500，开此收据为凭证")


# format:格式化输出,使用{}进行占位

# desc_info = "今天收到{}，交来学费500，开此收据为凭证"
# name = input("请输入姓名")
# s1 = desc_info.format(name)
# print(s1)


# s2 = "我的名字：{}，年龄：{}，性别：{}".format("小红",18,"女")
# print(s2)


# format的高级用法
# 通过下标来控制 传入的数据 显示的位置
# s2 = "vvv：{1}，bbb：{2}，rrr：{0}".format("小红", 18, "女")
# print(s2)

# 通过变量名来控制显示的位置
# s2 = "vvv：{a}，bbb：{b}，rrr：{a}".format(a="小红", b=18, c="女")
# print(s2)

# s2 = "vvv：{a}，bbb：{a}，rrr：{a}".format(a="小红")
# print(s2)


# 可以指定占的位置长度
# 默认靠左显示
# s2 = "vvv:{:10}888888888".format('pppp')
# 可以通过> <  ^  来控制靠左 靠右 或者是居中显示
# 靠左
# s2 = "vvv:{:<10}888888888".format('pppp')
# 靠右
# s2 = "vvv:{:>10}888888888".format('pppp')
# 居中
# s2 = "vvv:{:^10}888888888".format('pppp')
# print(s2)

# 格式化浮点数的小数点后的位数
# s = "数字:{:.4f}".format(2.222777777777)
# print(s)

# 格式化 数值的百分比形式显示
# s = "数字:{:.2%}".format(0.5)
# print(s)


#  传统的格式化输出方法
# 使用%来进行占位

# %f  只能为数值类型占位，显示的是带小数的形式
# %d  只能为数值类型占位，显示的整数的形式
# %s  万能的占位符（字符串，整数，浮点数都可以）

# ss = "python:%s,年龄：%f,"%("666",7.8)
# ss = "python:%s,年龄：%d"%(8.9,90)
# print(ss)
# print("年龄：%s，性别：%s" %(89,"男"))

#  扩展F表达式（最好用的一种，目前还不是特别流行）
# 字符串定义的时候前面加个f/F
name = input("请输入姓名")
age = 18
gender = "男"

s2 = f"姓名{name},年龄{age * 2}，性别：{gender}"
print(s2)
