"""
============================
Author:柠檬班-木森
Time:2019/12/30
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

# 数据内容发送变化，id不变的是可变类型数据，数据发送变化，id也发送了变化（意味着不在是同一个数据了)，那么就是不可变
# ----------------不可变的数据类型--------------
# 数值
# a = 10
# print(id(a))
# a = a + 1
# print(id(a))
# 字符串
# s = "123abc"
# print(id(s))
# s = s.replace('1', '9')
# print(id(s))

# 元组
# tu = (1, 2, 3)
# print(id(tu))
# tu = (11, 22, 33) + tu
# print(id(tu))


# --------可变的数据类型-----------------------
# 列表
li = [11, 2, 3]
print(id(li))

li.append(44)

print(id(li))

# 字典


# 集合
