"""
============================
Author:柠檬班-木森
Time:2020/2/28   19:42
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
2、正则表达式练习题

    1、写一个正则表达式，能匹配所有合法的python标识符

    2、s="1987-02-09 07:30:00 "，匹配出前面字符串中的年 月 日

    3、s="aaaa  xiasd@163.com 77777777777 xiaori@139.com aaaaaaa"",匹配前面字符串中的所有的邮箱地址

"""
import re

# s =  "number_999 python "
# r1 = r"\b[a-zA-Z_][a-zA-Z0-9_]*\b"

# \w:数字、字母、下划线：

# s="1987-02-09 07:30:00 "
# r2 = r"(\d+?)-(\d+?)-(\d+?) "
# print(re.findall(r2,s))

# r3 = r"\w+@\d+.com"
